Revit 2027 API
RectangleLightShape.EmitWidth Property
 The emit width.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EmitWidth { get; set; }
Public Property EmitWidth As Double
	Get
	Set
public:
property double EmitWidth {
	double get ();
	void set (double value);
}
member EmitWidth : float with get, set
Property Value
Double
 The emit width as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
Reference
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace